const express = require('express');
const app = express();
const port = process.env.PORT || 3000; 

let data = [
 {
        id:1,
        essaysTitle: "这是一篇测试内容",
        detail: "长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试长文本测试",
        remark: "无",
        author: "陈凯",
        time: "2020-05-10 10:00:00"
        },
        { 
        id:2,
        essaysTitle: "这是一篇测试内容",
        detail: "测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容",
        remark: "无",
        author: "陈凯",
        time: "2020-05-10 10:00:00"
        },
        { 
        id:3,
        essaysTitle: "这是一篇测试内容",
        detail: "测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容",
        remark: "无",
        author: "陈凯",
        time: "2020-05-10 10:00:00"
        },
        { 
        id:4,
        essaysTitle: "这是一篇测试内容",
        detail: "测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容",
        remark: "无",
        author: "陈凯",
        time: "2020-05-10 10:00:00"
        },
        { 
        id:5,
        essaysTitle: "这是一篇测试内容",
        detail: "测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容",
        remark: "无",
        author: "陈凯",
        time: "2020-05-10 10:00:00"
        },
        { 
        id:6,
        essaysTitle: "这是一篇测试内容",
        detail: "测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容",
        remark: "无",
        author: "陈凯",
        time: "2020-05-10 10:00:00"
        },
        { 
        id:7,
        essaysTitle: "这是一篇测试内容",
        detail: "测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容",
        remark: "无",
        author: "陈凯",
        time: "2020-05-10 10:00:00"
        },
        { 
        id:8,
        essaysTitle: "这是一篇测试内容",
        detail: "测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容",
        remark: "无",
        author: "陈凯",
        time: "2020-05-10 10:00:00"
        },
        { 
        id:9,
        essaysTitle: "这是一篇测试内容",
        detail: "测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容",
        remark: "无",
        author: "陈凯",
        time: "2020-05-10 10:00:00"
        },
        { 
        id:10,
        essaysTitle: "这是一篇测试内容",
        detail: "测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容",
        remark: "无",
        author: "陈凯",
        time: "2020-05-10 10:00:00"
        },
        { 
        id:11,
        essaysTitle: "这是一篇测试内容",
        detail: "测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容",
        remark: "无",
        author: "陈凯",
        time: "2020-05-10 10:00:00"
        },
        { 
        id:12,
        essaysTitle: "这是一篇测试内容",
        detail: "测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容测试内容",
        remark: "无",
        author: "陈凯",
        time: "2020-05-10 10:00:00"
        }
];

app.get('/api/data', (req, res) => {
  res.json(data);
});

app.listen(port, () => {
  console.log(`App running on http://localhost:${port}`);
});